#!/usr/bin/env python3
# _*_ coding: utf-8 _*_
"""
文件名称:acudc260_test_report_table_heading.py
功能描述:定义测试结果列名
创建日期:2025-08-05
作者:王洋
版本:v1.0
修改记录:
"""


class TableTitle:
    REAL_TIME_MEASURE_COLUMNS_OF_DC260 = [
        '测试用例',
        'voltage_accuracy',
        'current_accuracy',
        'power_accuracy',
        '电压输入值',
        '电流1输入值',
        '电流2输入值',

        '电压测量最小值',
        '电压精度最小值',
        '电压测量最大值',
        '电压精度最大值',
        '电压测量平均值',
        '电压精度平均值',
        '电压精度测试结果',

        '电流1测量最小值',
        '电流1精度最小值',
        '电流1测量最大值',
        '电流1精度最大值',
        '电流1测量平均值',
        '电流1精度平均值',
        '电流1精度测试结果',

        '电流2测量最小值',
        '电流2精度最小值',
        '电流2测量最大值',
        '电流2精度最大值',
        '电流2测量平均值',
        '电流2精度平均值',
        '电流2精度测试结果',

        '功率1输入值',
        '功率1测量最小值',
        '功率1精度最小值',
        '功率1测量最大值',
        '功率1精度最大值',
        '功率1测量平均值',
        '功率1精度平均值',
        '功率1精度测试结果',

        '功率2输入值',
        '功率2测量最小值',
        '功率2精度最小值',
        '功率2测量最大值',
        '功率2精度最大值',
        '功率2测量平均值',
        '功率2精度平均值',
        '功率2精度测试结果',

        '功率总输入值',
        '功率总测量最小值',
        '功率总精度最小值',
        '功率总测量最大值',
        '功率总精度最大值',
        '功率总测量平均值',
        '功率总精度平均值',
        '功率总精度测试结果',
    ]



if __name__ == '__main__':
    out_name = [i for i in TableTitle.REAL_TIME_MEASURE_COLUMNS_OF_DC260]
    print(out_name)
